docs/ops/pulumi.html
<!doctype html>
<html lang="en">
<head>
<title></title>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-3 col-md-push-9"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-"><code>ignoreChanges</code></a></li>
<li><a href="#sec-">adding secrets to config</a></li>
<li><a href="#sec-">OnCreateResource hooks</a>
<ul class="nav">
<li><a href="#sec-">1. Use dynamic providers/resources</a></li>
<li><a href="#sec-">2. Using CrossGuard</a></li>
</ul>
</li>
</ul>
</div>
</nav>
</div><div class="col-md-9 col-md-pull-3"><h1 class="title"></h1>
<div id="outline-container-sec-" class="outline-2">
<h2 id="sec-"><code>ignoreChanges</code></h2>
<div class="outline-text-2" id="text-">
<p>
This option specifies a list of properties which will be ignored when updating existing resources. Any properties specified in this list, that are also specified in the resource’s arguments, will only be used when creating the resource—and ignored entirely while updating it.<br >
</p>

<p>
For instance, in this example, the resource’s prop property will have its value of "new-value" set when initially creating resource, but from then on, any and all changes will be ignored: (from <a href="https://www.pulumi.com/docs/intro/concepts/programming-model/#ignorechanges">pulumi.com/docs</a>)<br >
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #b58900;">res</span> = MyResource(<span style="color: #2aa198;">"res"</span>,
    prop=<span style="color: #2aa198;">"new-value"</span>,
    opts=ResourceOptions(ignore_changes=[<span style="color: #2aa198;">"prop"</span>]))
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-" class="outline-2">
<h2 id="sec-">adding secrets to config</h2>
<div class="outline-text-2" id="text-">
<pre class="example">
pulumi config set secrets:SSH_KEY --secret &lt; PATH_TO_KEY
</pre>
</div>
</div>


<div id="outline-container-sec-" class="outline-2">
<h2 id="sec-">OnCreateResource hooks</h2>
<div class="outline-text-2" id="text-">
<p>
There is no straightforward way to do this, but two options exist (<a href="https://pulumi-community.slack.com/archives/CDE799L1M/p1597668356273400">pulumi-community.slack.com</a>).<br >
</p>
</div>

<div id="outline-container-sec-" class="outline-3">
<h3 id="sec-">1. Use dynamic providers/resources</h3>
<div class="outline-text-3" id="text-">
<p>
This approach creates a new dynamic resources that depends on the resource that was created. It has its own <code>create()</code> implementation that<br >
serves as the hook.<br >
</p>

<p>
See <a href="https://www.pulumi.com/docs/intro/concepts/programming-model/#dynamicproviders">pulumi.com/docs</a> and an example implementation for AWS EC2 provisioners, <a href="https://github.com/pulumi/examples/blob/master/aws-py-ec2-provisioners/__main__.py">__main__.py</a> and <a href="https://github.com/pulumi/examples/blob/master/aws-py-ec2-provisioners/provisioners.py">provisioners.py</a> on GitHub.<br >
</p>

<p>
Example:<br >
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #859900;">from</span> typing <span style="color: #859900;">import</span> Optional, Any
<span style="color: #859900;">from</span> uuid <span style="color: #859900;">import</span> uuid4
<span style="color: #859900;">import</span> pulumi
<span style="color: #859900;">from</span> pulumi <span style="color: #859900;">import</span> dynamic
<span style="color: #859900;">class</span> <span style="color: #b58900;">OnCreateWarningProvider</span>(dynamic.ResourceProvider):
    <span style="color: #b58900;">warning_printed</span> = <span style="color: #6c71c4;">False</span>
    <span style="color: #859900;">def</span> <span style="color: #268bd2;">print_warning</span>(<span style="color: #859900;">self</span>, message):
        <span style="color: #859900;">if</span> <span style="color: #859900;">not</span> <span style="color: #859900;">self</span>.warning_printed:
            pulumi.warn(message)
            <span style="color: #b58900;">OnCreateWarningProvider.warning_printed</span> = <span style="color: #6c71c4;">True</span>
    <span style="color: #859900;">def</span> <span style="color: #268bd2;">create</span>(<span style="color: #859900;">self</span>, inputs: Any):
        <span style="color: #859900;">self</span>.print_warning(inputs[<span style="color: #2aa198;">'message'</span>])
        <span style="color: #859900;">return</span> dynamic.CreateResult(id_=uuid4().<span style="color: #6c71c4;">hex</span>, outs={})
<span style="color: #859900;">class</span> <span style="color: #b58900;">OnCreateWarning</span>(dynamic.Resource):
    <span style="color: #859900;">def</span> <span style="color: #268bd2;">__init__</span>(<span style="color: #859900;">self</span>, name: <span style="color: #6c71c4;">str</span>, message: <span style="color: #6c71c4;">str</span>, opts: Optional[pulumi.ResourceOptions] = <span style="color: #6c71c4;">None</span>):
        <span style="color: #6c71c4;">super</span>().__init__(
            OnCreateWarningProvider(),
            name,
            {<span style="color: #2aa198;">'message'</span>: message},
            opts=opts
        )
</pre>
</div>

<p>
which gets called by<br >
</p>

<div class="org-src-container">

<pre class="src src-python">messaging.OnCreateWarning(
    name=f<span style="color: #2aa198;">"on-create-warning-{resource_name}"</span>,
    message=<span style="color: #2aa198;">"Resource was created!"</span>,
    opts=pulumi.ResourceOptions(depends_on=[resource]),
)
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-" class="outline-3">
<h3 id="sec-">2. Using CrossGuard</h3>
<div class="outline-text-3" id="text-">
<p>
With a CrossGuard <code>ResourceValidationPolicy</code>, see for example  <a href="https://github.com/pulumi/templates-policy/blob/master/aws-python/__main__.py#L10-L15">github.com/pulumi</a>. Run Pulumi with<br >
</p>
<pre class="example">
pulumi up --policy-pack path-to-policy-code/
</pre>
</div>
</div>
</div>
</div></div></div>
</body>
</html>
